7767517
108 120
Input            input                    0 1 input
MemoryData       99                       0 1 99 0=1
MemoryData       106                      0 1 106 0=38 1=38 2=512
Convolution      72                       1 1 input 72 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             73                       1 1 72 73
Convolution      74                       1 1 73 74 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             75                       1 1 74 75
Pooling          76                       1 1 75 76 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      77                       1 1 76 77 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             78                       1 1 77 78
Convolution      79                       1 1 78 79 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             80                       1 1 79 80
Pooling          81                       1 1 80 81 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      82                       1 1 81 82 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             83                       1 1 82 83
Convolution      84                       1 1 83 84 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             85                       1 1 84 85
Convolution      86                       1 1 85 86 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             87                       1 1 86 87
Pooling          88                       1 1 87 88 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=0
Convolution      89                       1 1 88 89 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             90                       1 1 89 90
Convolution      91                       1 1 90 91 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             92                       1 1 91 92
Convolution      93                       1 1 92 93 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             94                       1 1 93 94
Split            splitncnn_0              1 3 94 94_splitncnn_0 94_splitncnn_1 94_splitncnn_2
BinaryOp         96                       1 1 94_splitncnn_2 96 0=6
Reduction        97                       1 1 96 97 0=0 1=0 -23303=1,1 4=1
UnaryOp          98                       1 1 97 98 0=5
BinaryOp         100                      2 1 98 99 100 0=0
BinaryOp         101                      2 1 94_splitncnn_1 100 101 0=3
BinaryOp         107                      2 1 106 101 107 0=2
Split            splitncnn_1              1 2 107 107_splitncnn_0 107_splitncnn_1
Pooling          108                      1 1 94_splitncnn_0 108 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      109                      1 1 108 109 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             110                      1 1 109 110
Convolution      111                      1 1 110 111 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             112                      1 1 111 112
Convolution      113                      1 1 112 113 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             114                      1 1 113 114
Pooling          115                      1 1 114 115 0=0 1=3 11=3 2=1 12=1 3=1 13=1 14=1 15=1 5=1
Convolution      116                      1 1 115 116 0=1024 1=3 11=3 2=6 12=6 3=1 13=1 4=6 14=6 15=6 16=6 5=1 6=4718592
ReLU             117                      1 1 116 117
Convolution      118                      1 1 117 118 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
ReLU             119                      1 1 118 119
Split            splitncnn_2              1 3 119 119_splitncnn_0 119_splitncnn_1 119_splitncnn_2
Convolution      120                      1 1 119_splitncnn_2 120 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             121                      1 1 120 121
Convolution      122                      1 1 121 122 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             123                      1 1 122 123
Split            splitncnn_3              1 3 123 123_splitncnn_0 123_splitncnn_1 123_splitncnn_2
Convolution      124                      1 1 123_splitncnn_2 124 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             125                      1 1 124 125
Convolution      126                      1 1 125 126 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             127                      1 1 126 127
Split            splitncnn_4              1 3 127 127_splitncnn_0 127_splitncnn_1 127_splitncnn_2
Convolution      128                      1 1 127_splitncnn_2 128 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             129                      1 1 128 129
Convolution      130                      1 1 129 130 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=294912
ReLU             131                      1 1 130 131
Split            splitncnn_5              1 3 131 131_splitncnn_0 131_splitncnn_1 131_splitncnn_2
Convolution      132                      1 1 131_splitncnn_2 132 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             133                      1 1 132 133
Convolution      134                      1 1 133 134 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=294912
ReLU             135                      1 1 134 135
Split            splitncnn_6              1 2 135 135_splitncnn_0 135_splitncnn_1
Convolution      136                      1 1 107_splitncnn_1 136 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
Permute          137                      1 1 136 137 0=3
Convolution      138                      1 1 107_splitncnn_0 138 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=387072
Permute          139                      1 1 138 139 0=3
Convolution      140                      1 1 119_splitncnn_1 140 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=221184
Permute          141                      1 1 140 141 0=3
Convolution      142                      1 1 119_splitncnn_0 142 0=126 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1161216
Permute          143                      1 1 142 143 0=3
Convolution      144                      1 1 123_splitncnn_1 144 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Permute          145                      1 1 144 145 0=3
Convolution      146                      1 1 123_splitncnn_0 146 0=126 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=580608
Permute          147                      1 1 146 147 0=3
Convolution      148                      1 1 127_splitncnn_1 148 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Permute          149                      1 1 148 149 0=3
Convolution      150                      1 1 127_splitncnn_0 150 0=126 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=290304
Permute          151                      1 1 150 151 0=3
Convolution      152                      1 1 131_splitncnn_1 152 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Permute          153                      1 1 152 153 0=3
Convolution      154                      1 1 131_splitncnn_0 154 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=193536
Permute          155                      1 1 154 155 0=3
Convolution      156                      1 1 135_splitncnn_1 156 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Permute          157                      1 1 156 157 0=3
Convolution      158                      1 1 135_splitncnn_0 158 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=193536
Permute          159                      1 1 158 159 0=3
Reshape          167                      1 1 137 167 0=-1
Reshape          175                      1 1 141 175 0=-1
Reshape          183                      1 1 145 183 0=-1
Reshape          191                      1 1 149 191 0=-1
Reshape          199                      1 1 153 199 0=-1
Reshape          207                      1 1 157 207 0=-1
Concat           208                      6 1 167 175 183 191 199 207 208 0=0
Reshape          216                      1 1 139 216 0=-1
Reshape          224                      1 1 143 224 0=-1
Reshape          232                      1 1 147 232 0=-1
Reshape          240                      1 1 151 240 0=-1
Reshape          248                      1 1 155 248 0=-1
Reshape          256                      1 1 159 256 0=-1
Concat           257                      6 1 216 224 232 240 248 256 257 0=0
Reshape          reg                      1 1 208 reg 0=4 1=-1
Reshape          277                      1 1 257 277 0=21 1=-1
Softmax          cls                      1 1 277 cls 0=1 1=1
