7767517
99 110
Input            input                    0 1 input
Convolution      71                       1 1 input 71 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             72                       1 1 71 72
Convolution      73                       1 1 72 73 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             74                       1 1 73 74
Pooling          75                       1 1 74 75 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      76                       1 1 75 76 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             77                       1 1 76 77
Convolution      78                       1 1 77 78 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             79                       1 1 78 79
Pooling          80                       1 1 79 80 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      81                       1 1 80 81 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             82                       1 1 81 82
Convolution      83                       1 1 82 83 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             84                       1 1 83 84
Convolution      85                       1 1 84 85 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             86                       1 1 85 86
Pooling          87                       1 1 86 87 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=1 15=1 5=1
Convolution      88                       1 1 87 88 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             89                       1 1 88 89
Convolution      90                       1 1 89 90 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             91                       1 1 90 91
Convolution      92                       1 1 91 92 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             93                       1 1 92 93
Split            splitncnn_0              1 3 93 93_splitncnn_0 93_splitncnn_1 93_splitncnn_2
Pooling          94                       1 1 93_splitncnn_2 94 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      95                       1 1 94 95 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             96                       1 1 95 96
Convolution      97                       1 1 96 97 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             98                       1 1 97 98
Convolution      99                       1 1 98 99 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             100                      1 1 99 100
Pooling          101                      1 1 100 101 0=0 1=3 11=3 2=1 12=1 3=1 13=1 14=1 15=1 5=1
Convolution      102                      1 1 101 102 0=1024 1=3 11=3 2=6 12=6 3=1 13=1 4=6 14=6 15=6 16=6 5=1 6=4718592
ReLU             103                      1 1 102 103
Convolution      104                      1 1 103 104 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1048576
ReLU             105                      1 1 104 105
Split            splitncnn_1              1 3 105 105_splitncnn_0 105_splitncnn_1 105_splitncnn_2
Convolution      106                      1 1 105_splitncnn_2 106 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             107                      1 1 106 107
Convolution      108                      1 1 107 108 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             109                      1 1 108 109
Split            splitncnn_2              1 3 109 109_splitncnn_0 109_splitncnn_1 109_splitncnn_2
Convolution      110                      1 1 109_splitncnn_2 110 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             111                      1 1 110 111
Convolution      112                      1 1 111 112 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             113                      1 1 112 113
Split            splitncnn_3              1 3 113 113_splitncnn_0 113_splitncnn_1 113_splitncnn_2
Convolution      114                      1 1 113_splitncnn_2 114 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             115                      1 1 114 115
Convolution      116                      1 1 115 116 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=294912
ReLU             117                      1 1 116 117
Split            splitncnn_4              1 3 117 117_splitncnn_0 117_splitncnn_1 117_splitncnn_2
Convolution      118                      1 1 117_splitncnn_2 118 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             119                      1 1 118 119
Convolution      120                      1 1 119 120 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=294912
ReLU             121                      1 1 120 121
Split            splitncnn_5              1 2 121 121_splitncnn_0 121_splitncnn_1
Convolution      122                      1 1 93_splitncnn_1 122 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
Permute          123                      1 1 122 123 0=3
Convolution      124                      1 1 93_splitncnn_0 124 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=387072
Permute          125                      1 1 124 125 0=3
Convolution      126                      1 1 105_splitncnn_1 126 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=221184
Permute          127                      1 1 126 127 0=3
Convolution      128                      1 1 105_splitncnn_0 128 0=126 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1161216
Permute          129                      1 1 128 129 0=3
Convolution      130                      1 1 109_splitncnn_1 130 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Permute          131                      1 1 130 131 0=3
Convolution      132                      1 1 109_splitncnn_0 132 0=126 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=580608
Permute          133                      1 1 132 133 0=3
Convolution      134                      1 1 113_splitncnn_1 134 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Permute          135                      1 1 134 135 0=3
Convolution      136                      1 1 113_splitncnn_0 136 0=126 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=290304
Permute          137                      1 1 136 137 0=3
Convolution      138                      1 1 117_splitncnn_1 138 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Permute          139                      1 1 138 139 0=3
Convolution      140                      1 1 117_splitncnn_0 140 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=193536
Permute          141                      1 1 140 141 0=3
Convolution      142                      1 1 121_splitncnn_1 142 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Permute          143                      1 1 142 143 0=3
Convolution      144                      1 1 121_splitncnn_0 144 0=84 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=193536
Permute          145                      1 1 144 145 0=3
Reshape          153                      1 1 123 153 0=-1
Reshape          161                      1 1 127 161 0=-1
Reshape          169                      1 1 131 169 0=-1
Reshape          177                      1 1 135 177 0=-1
Reshape          185                      1 1 139 185 0=-1
Reshape          193                      1 1 143 193 0=-1
Concat           194                      6 1 153 161 169 177 185 193 194 0=0
Reshape          202                      1 1 125 202 0=-1
Reshape          210                      1 1 129 210 0=-1
Reshape          218                      1 1 133 218 0=-1
Reshape          226                      1 1 137 226 0=-1
Reshape          234                      1 1 141 234 0=-1
Reshape          242                      1 1 145 242 0=-1
Concat           243                      6 1 202 210 218 226 234 242 243 0=0
Reshape          reg                      1 1 194 reg 0=4 1=-1 2=1
Reshape          267                      1 1 243 267 0=21 1=-1 2=1
Softmax          cls                      1 1 267 cls 0=2 1=1
